app/controllers/post_controller.rb

  def create
    newPost = Post.new
    newPost.title = params[:title]
    newPost.content = params[:content]
    newPost.user = current_user
    if params[:avatar]
      newPost.avatar = params[:avatar]
    end
    newPost.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "새로운 글입니다"], ["content", "루비 넘나 어려운것"], ["user_id", 1], ["created_at", 2017-05-10 12:04:54 UTC], ["updated_at", 2017-05-10 12:04:54 UTC]]

  def destroy
    destroyPost = Post.find(params[:id])
    destroyPost.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]

  def index
    @listPost = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    @showPost = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @editPost = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    updatePost = Post.find(params[:id])
    updatePost.title = params[:title]
    updatePost.content = params[:content]
    updatePost.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "ㄱ갓선재 ㄸㄷ"], ["content", "크으"], ["updated_at", 2017-04-10 12:53:45 UTC], ["id", 2]]